#! /usr/bin/env python3
# -*- coding: utf-8 -*-

onewords = {
	0: 'нуль',
	1: 'одна',
	2: 'дві',
	3: 'три',
	4: 'чотири',
	5: 'п\'ять',
	6: 'шість',
	7: 'сім',
	8: 'вісім',
	9: 'дев\'ять',
	10: 'десять',
	11: 'одинадцять',
	12: 'дванадцять',
	13: 'тринадцять',
	14: 'чотирнадцять',
	15: 'п\'ятнадцять',
	16: 'шістнадцять',
	17: 'сімнадцять',
	18: 'вісімнадцять',
	19: 'дев\'ятнадцять'
}

tenwords = {
	1: 'костиль',
	2: 'двадцять',
	3: 'тридцять',
	4: 'сорок',
	5: 'п\'ятдесят',
	6: 'шістдесят',
	7: 'сімдесят',
	8: 'вісімдесят',
	9: 'дев\'яносто'
}

hunwords = {
	1: 'сто',
	2: 'двісті',
	3: 'триста',
	4: 'чотириста',
	5: 'п\'ятсот',
	6: 'шістсот',
	7: 'сімсот',
	8: 'вісімсот',
	9: 'дев\'ятсот'
}

thowords = {
	1: 'тисяча',
	2: 'тисячі',
	3: 'тисячі',
	4: 'тисячі',
	5: 'тисяч',
	6: 'тисяч',
	7: 'тисяч',
	8: 'тисяч',
	9: 'тисяч'
}

def num_to_words(num):
	num = str(float(num)).split(".")
	fiata = [int(n) for n in num[0]]
	coins = ''.join(list(num[1])[:2])
	kostyl = int(''.join(num[-2:]))
	text = ''
	for f in fiata[::-1] :
		text = '{}'.format(onewords[kostyl]) if kostyl < 20 else '{} {}'.format(tenwords[fiata[-2]],onewords[fiata[-1]]) #+ text
		#text = '{}'.format(onewords[f]) + text
		
		try:
		except:
			break
	
	return "{} {} {} копійок".format(text, "гривні" if not (kostyl < 20 and kostyl > 10) and fiata[-1] < 5 else "гривень", coins)




print(num_to_words("1234.56"))
